<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Identifier</key>
        <string>com.github.faumac.download.darktable</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>darktable</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>GitHubReleasesInfoProvider</string>
                <key>Arguments</key>
                <dict>
                    <key>github_repo</key>
                    <string>darktable-org/darktable</string>
                  <key>asset_regex</key>
                  <string>darktable-[0-9\.]+\.dmg$</string>
                </dict>
            </dict>
          <dict>
              <key>Processor</key>
              <string>URLDownloader</string>
              <key>Arguments</key>
              <dict>
                  <key>filename</key>
                  <string>%NAME%-%version%.dmg</string>
              </dict>
          </dict>
          <dict>
              <key>Processor</key>
              <string>EndOfCheckPhase</string>
          </dict>
          <dict>
           <key>Processor</key>
           <string>CodeSignatureVerifier</string>
           <key>Arguments</key>
           <dict>
              <key>input_path</key>
              <string>%pathname%/darktable.app</string>
              <key>requirement</key>
                  <string>identifier "org.darktable" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "85Q3K4KQRY"</string>
          </dict>
      </dict>
  </array>
  </dict>
  </plist>
